nfi/cooja-ng/include/arm/nrf54l15_soc.h
/*
 * nRF54L15 SoC peripheral bundle — first cut.
 *
 * Models the bare minimum to clear the Reset_Handler boot path. Right
 * now that's exactly one peripheral:
 *
 *   - GLOBAL_CLOCK at 0x5010_E000 (offsets discovered empirically with
 *     hello-world.nrf54l15-dk — see devices/nrf54l15-dk/STATUS.md).
 *     Handles the HFXO start handshake: firmware writes 1 to
 *     TASKS_HFXOSTART (offset 0), then spins reading
 *     EVENTS_HFXOSTARTED (offset 0x100) until non-zero. We latch the
 *     event immediately so nrfx_clock_start exits.
 *
 * Everything else (GRTC, UARTE20, GPIO/GPIOTE, RADIO, DPPI, …) lands
 * in subsequent commits, driven by what firmware actually traps on.
 *
 * Plugs into `arm_platform_t` through the `arm_soc_ops_t` vtable in
 * `arm_platform.h`. Note: the address range is 0x5xxx_xxxx, NOT
 * 0x4xxx_xxxx as on nRF52 — different peripheral region entirely.
 */
#ifndef NRF54L15_SOC_H
#define NRF54L15_SOC_H

#include "arm_platform.h"
#include "nrf54l15_spim.h"

/* GLOBAL_CLOCK at 0x5010_E000 (peripheral ID 0x10E in the application
 * domain).  Offsets discovered empirically — see the trace comment in
 * `nrf54l15_soc.c`.  We only model the single event the boot path
 * polls; other registers accept writes as no-ops and read 0. */
/* RESET.RESETREAS bits (0x5010_E600). Latched across a reset so the secure
 * world can report why it rebooted; write-1-to-clear. */
#define NRF54L_RESETREAS_RESETPIN   (1u << 0)
#define NRF54L_RESETREAS_DOG0       (1u << 1)
#define NRF54L_RESETREAS_DOG1       (1u << 2)
#define NRF54L_RESETREAS_SREQ       (1u << 6)
#define NRF54L_RESETREAS_LOCKUP     (1u << 7)

typedef struct nrf54l_global_clock_state {
    /* Latched events.  Each is set to 1 when the corresponding TASKS_*
     * register is written with value 1, and cleared by an explicit
     * write of 0 (firmware acknowledging the event).
     *
     * The two task/event pair sets observed during boot:
     *
     *   nrf_802154_clock_init:
     *     0x000 TASKS_HFCLKSTART → 0x100 EVENTS_HFCLKSTARTED  (`hfclkstarted`)
     *     0x008 TASKS_LFCLKSTART → 0x104 EVENTS_LFCLKSTARTED  (`lfclkstarted`)
     *
     *   nrfx_clock_start:
     *     0x010 TASKS_HFXOSTART  → 0x108 EVENTS_HFXOSTARTED   (`hfxostarted`)
     */
    uint32_t hfclkstarted;      /* 0x100 */
    uint32_t lfclkstarted;      /* 0x104 */
    uint32_t hfxostarted;       /* 0x108 */
    uint32_t domain_enable_440; /* 0x440 — clock-domain enable */
    /* RESET.RESETREAS lives in this same 4 KB page (0x5010_E600); the CLOCK,
     * POWER and RESET peripherals share the base address on this SoC. It
     * survives a warm reset, which is the whole point of it. */
    uint32_t resetreas;
} nrf54l_global_clock_state_t;

/* UARTE20 at 0x500C_6000.  Pure EasyDMA — no legacy register window
 * (nrf54l15 does not expose one).
 *
 * Register subset modelled (per the SVD):
 *   0x050  TASKS_DMA.TX.START   — write 1 → emit MAXCNT bytes from PTR
 *   0x054  TASKS_DMA.TX.STOP    — write 1 → latch EVENTS_TXSTOPPED
 *   0x130  EVENTS_TXSTOPPED     — set by START/STOP (SHORTS_ENDTX_STOPTX)
 *   0x168  EVENTS_DMA.TX.END    — set by START after byte emission
 *   0x500  ENABLE               — 8 = UARTE EasyDMA mode (accepted)
 *   0x73C  DMA.TX.PTR           — SRAM source pointer
 *   0x740  DMA.TX.MAXCNT        — byte count for next transfer
 *   0x744  DMA.TX.AMOUNT        — bytes transferred (read-back)
 *
 * RX path, INTEN, PSEL, BAUDRATE, CONFIG, FRAMETIMEOUT, PUBLISH/SUBSCRIBE,
 * and the matching RX-DMA registers are accepted as no-ops.  Real
 * hardware needs hundreds of µs per byte at 115200 baud; csim emits the
 * full buffer synchronously on TASKS_DMA.TX.START, latches the events,
 * and returns — matches the zero-latency shortcut philosophy of the
 * GLOBAL_CLOCK stub.
 */
typedef struct nrf54l_uarte_state {
    arm_platform_t      *plat;         /* back-pointer for arm_read8 */
    uint32_t             tx_ptr;
    uint32_t             tx_maxcnt;
    uint32_t             tx_amount;    /* bytes most-recently emitted */
    uint32_t             evt_txstopped;
    uint32_t             evt_dma_tx_end;
    uint32_t             enable;
    arm_uart_tx_callback tx_cb;
    void                *tx_user;
    /* Receive side, EasyDMA like the transmit side. Contiki arms a
     * single-byte transfer and re-arms it from the completion handler, so a
     * byte arriving while a transfer is armed is written straight to the
     * buffer and completes it. Bytes arriving with no transfer armed wait in
     * the ring until one is. */
    uint32_t             rx_ptr, rx_maxcnt, rx_amount;
    uint32_t             evt_dma_rx_end, evt_dma_rx_ready, evt_rxdrdy;
    uint32_t             inten;
    bool                 rx_active;
    uint8_t              rx_fifo[256];
    int                  rx_head, rx_tail;
    int                  irq_num;
    /* Received bytes are paced at one character time, as they arrive on a
     * wire. Without it a whole injected line lands as fast as the firmware
     * can re-arm its single-byte transfer, and the driver overwrites the
     * buffer under itself. */
    arm_event_t          rx_pace_event;
    int                  rx_pace_scheduled;
} nrf54l_uarte_state_t;

struct nrf54l15_soc;
/* Drive an input pin of GPIO port 0..2 from outside (see in_forced).
 * Returns 0, or -1 for a bad port/pin. */
int nrf54l15_soc_set_input_pin(struct nrf54l15_soc *soc, int port, int pin, int level);

/* Feed received bytes to the console (the harness's serial input). */
void nrf54l_uarte_feed_rx(struct nrf54l15_soc *soc, const uint8_t *buf, int len);

/* DPPI (Distributed Programmable Peripheral Interconnect) — a 32-channel
 * routing fabric.  Peripherals publish events on a channel (via their
 * PUBLISH_<event> register: bit 31 = EN, bits 4..0 = channel ID) and
 * subscribe tasks to channels (via SUBSCRIBE_<task>, same shape).  When
 * a publisher fires and its channel is enabled (DPPIC.CHEN[channel]),
 * every subscriber's task callback runs.
 *
 * Nordic's nrf54l15 actually has multiple DPPI controllers (DPPIC00 at
 * 0x5004_2000, DPPIC10 at 0x5008_2000, DPPIC20 at 0x500C_2000, DPPIC30
 * at 0x5010_2000) each with their own 32-channel space, bridged across
 * domains by PPIB.  In csim we collapse all of them into one global
 * fabric — firmware-level channel IDs end up in the same 32-slot table
 * regardless of which DPPIC owns them.  This works as long as channel
 * allocations don't collide across domains, which Nordic's allocator
 * ensures in practice.
 *
 * Subscribers register via `nrf54l_dppi_subscribe` (small linked list
 * per channel since the same channel can drive multiple tasks); they
 * de-register via `_unsubscribe`.  Publishers call `_publish(channel)`
 * which walks the subscriber list and invokes each callback iff the
 * channel is enabled. */
#define NRF54L_DPPI_NUM_CHANNELS  32

typedef void (*nrf54l_dppi_sub_cb)(void *user);

