nfi/cooja-ng/include/arm/nrf54l15_soc.h
typedef struct nrf54l_dppi_subscriber {
    nrf54l_dppi_sub_cb         cb;
    void                      *user;
    struct nrf54l_dppi_subscriber *next;
} nrf54l_dppi_subscriber_t;

#define NRF54L_DPPI_NUM_GROUPS    6
struct nrf54l_dppi_state;
typedef struct {
    struct nrf54l_dppi_state *d;
    int                       g;
} nrf54l_dppi_chg_ctx_t;
typedef struct nrf54l_dppi_state {
    arm_platform_t            *plat;     /* back-pointer, for per-node tracing */
    uint32_t                   chen;     /* CHEN — bitmap of enabled channels */
    nrf54l_dppi_subscriber_t  *subs[NRF54L_DPPI_NUM_CHANNELS];
    /* Channel groups: CHG[n] membership, TASKS_CHG[n].EN/DIS enable or
     * disable every member channel at once, and SUBSCRIBE_CHG[n].EN/DIS
     * let a DPPI event do that. nrf_802154 makes its radio ramp-up chain
     * one-shot this way: the EGU event that fires RADIO TXEN/RXEN also
     * triggers CHG0.DIS on its own channel. A group task raised from
     * inside a publish is applied after that publish has reached every
     * subscriber, as on silicon, so the chain fires exactly once. */
    uint32_t                   chg[NRF54L_DPPI_NUM_GROUPS];
    uint32_t                   sub_chg_en[NRF54L_DPPI_NUM_GROUPS];
    uint32_t                   sub_chg_dis[NRF54L_DPPI_NUM_GROUPS];
    nrf54l_dppi_chg_ctx_t      chg_ctx[NRF54L_DPPI_NUM_GROUPS];
    uint32_t                   pending_chg_en;    /* group bitmaps raised by the publish in progress */
    uint32_t                   pending_chg_dis;
    int                        publish_depth;
} nrf54l_dppi_state_t;

/* GRTC (Global Real-Time Counter) at 0x500E_2000 — Contiki's tick source
 * + the timer Nordic's nrf_802154 driver hands MPSL for timeslot grants.
 * Without this, MPSL never fires `on_timeslot_started`, so RADIO is
 * never programmed.
 *
 * Subset modelled:
 *   0x060  TASKS_START
 *   0x068  TASKS_CLEAR
 *   0x100..0x12C  EVENTS_COMPARE[0..11]
 *   0x300  INTEN0 / 0x304 INTENSET0 / 0x308 INTENCLR0
 *   0x520..0x5BC  CC[0..11] (CCL/CCH/CCADD/CCEN, stride 0x10)
 *   0x720+0x000  SYSCOUNTER[0].SYSCOUNTERL  (== 0x720 / 0x740 / ...)
 *   0x720+0x004  SYSCOUNTER[0].SYSCOUNTERH
 *   0x720+0x028  SYSCOUNTER capture-ready bit (write 1 to trigger capture)
 *
 * The counter ticks at 1 MHz per Contiki's clock-arch.c (GRTC_TICK_FREQUENCY_HZ).
 * Compare events use CCADD (relative offset from current counter), not
 * absolute CC.  When firmware writes CC[n].CCADD and sets CCEN=1, we
 * schedule a CPU event `CCADD * 1000 ns` in the future that latches
 * EVENTS_COMPARE[n] and raises the GRTC IRQ. */
#define NRF54L_GRTC_NUM_CC   12

typedef struct nrf54l_grtc_cc {
    uint32_t ccl;
    uint32_t cch;
    uint32_t ccadd;
    uint32_t ccen;
    /* Which of {absolute CC, relative CCADD} was written most recently.
     * `nrfx_grtc_syscounter_cc_absolute_set` writes CCL/CCH (52-bit
     * absolute target) then sets CCEN; `_cc_relative_set` writes CCADD
     * then CCEN. The arm_cc routine picks fire_ns from whichever was
     * last touched. */
    int      absolute_mode;
    void    *event;        /* cpu_event_t* — null if not armed */
    int64_t  scheduled_ns; /* absolute fire_ns of the currently armed event;
                            * used to anchor RELATIVE_COMPARE re-arms (CCADD
                            * bit 31 == 0). 0 = no prior fire reference. */
} nrf54l_grtc_cc_t;

typedef struct nrf54l_grtc_state {
    arm_platform_t      *plat;
    nrf54l_dppi_state_t *dppi;          /* shared DPPI fabric */
    bool                 running;
    int64_t              start_anchor_ns;
    nrf54l_grtc_cc_t     cc[NRF54L_GRTC_NUM_CC];
    uint32_t             evt_compare[NRF54L_GRTC_NUM_CC];
    uint32_t             publish_compare[NRF54L_GRTC_NUM_CC];  /* PUBLISH_COMPARE[n] */
    uint32_t             inten;          /* INTEN2 (app-core, GRTC_2) — bit n = COMPARE[n] */
    uint32_t             inten_flpr;     /* INTEN0 (FLPR, GRTC_0) — routes to the RV32E core */
    uint32_t             inten1;         /* INTEN1 (GRTC_1) — the TrustZone normal world's group */
    uint32_t             captured_lo;    /* SYSCOUNTERL latched value */
    uint32_t             captured_hi;    /* SYSCOUNTERH latched value */
    int                  irq_num;        /* GRTC_2_IRQn = 228 */
} nrf54l_grtc_state_t;

/* RADIO at 0x5008_A000 — 2.4 GHz 802.15.4 transceiver.
 *
 * Register layout (per nrf54lv10a_enga_application.svd) is DRAMATICALLY
 * different from nRF52840.  Key offset shifts:
 *
 *   nRF52840              nrf54l15
 *   --------              --------
 *   TASKS:    0x000+      TASKS:        0x000+
 *   EVENTS:   0x100+      SUBSCRIBE:    0x100+
 *   SHORTS:   0x200       EVENTS:       0x200+
 *   INTENSET: 0x304       PUBLISH:      0x300+
 *   PACKETPTR:0x504       SHORTS:       0x400
 *   FREQUENCY:0x508       INTENSET00:   0x488
 *   PCNF0:    0x514       INTENSET10:   0x4A8 (second IRQ line)
 *   STATE:    0x550       MODE:         0x500, STATE: 0x520
 *                         FREQUENCY:    0x708
 *                         PCNF0:        0xE20
 *                         PACKETPTR:    0xED0
 *
 * Plus nrf54l15 routes its task triggers via DPPI exclusively —
 * Nordic's nrf_802154 driver doesn't write TASKS_TXEN directly.  Each
 * SUBSCRIBE_<task> register binds a DPPI channel; when something
 * publishes on that channel (typically GRTC compare or a previous
 * RADIO event via PUBLISH_<event>), the corresponding task fires.
 */
#define NRF54L_RADIO_NUM_SUBSCRIBES 12   /* TXEN..CCASTOP, contiguous 4-byte slots */
#define NRF54L_RADIO_NUM_PUBLISHES  24   /* READY..CTEPRESENT */

/* Per-SUBSCRIBE-slot DPPI binding.  Lives inside the owning radio instance
 * (not a file-scope table) so two nRF54L15 nodes never share binding slots —
 * a shared table let whichever node programmed a slot last own every node's
 * DPPI callback, cross-wiring radio state between motes. */
struct nrf54l_radio_state;
typedef struct {
    struct nrf54l_radio_state *radio;
    uint32_t                   task_off;
} nrf54l_radio_sub_binding_t;

