nfi/cooja-ng/include/arm/nrf54l15_soc.h
typedef struct nrf54l_radio_state {
    arm_platform_t      *plat;
    nrf54l_dppi_state_t *dppi;
    int                  irq_num_0;   /* RADIO_0 IRQn = 138 */
    int                  irq_num_1;   /* RADIO_1 IRQn = 139 */
    nrf54l_radio_sub_binding_t sub_bindings[NRF54L_RADIO_NUM_SUBSCRIBES];

    uint32_t state;                   /* 0=DISABLED, 2=RXIDLE, 3=RX, 10=TXIDLE, 11=TX */
    uint32_t shorts;
    uint32_t intenset00;
    uint32_t intenset10;

    /* Config — kept verbatim for read-back; only a few are interpreted. */
    uint32_t mode, frequency, txpower, timing;
    uint32_t pcnf0, pcnf1, crccnf, crcpoly, crcinit;
    uint32_t txaddress, rxaddresses;
    uint32_t bcc;                     /* bit-counter compare (in bits, not bytes) */
    uint32_t packetptr;

    /* SUBSCRIBE channels (one per task slot 0..11, value 0 = disabled, else
     * 0x80000000 | channel_id).  We also track the bound channel
     * separately so we can unsubscribe before re-subscribing. */
    uint32_t subscribe[NRF54L_RADIO_NUM_SUBSCRIBES];
    int      sub_channel[NRF54L_RADIO_NUM_SUBSCRIBES];   /* -1 = unbound */

    /* PUBLISH channels (one per event slot 0..23). */
    uint32_t publish[NRF54L_RADIO_NUM_PUBLISHES];

    /* Latched events.  Each evt_<x> is 1 after the event fires until
     * firmware writes 0 to the corresponding offset. */
    uint32_t evt_ready, evt_txready, evt_rxready;
    uint32_t evt_address, evt_framestart, evt_payload;
    uint32_t evt_end,    evt_phyend,    evt_disabled;
    uint32_t evt_devmatch, evt_devmiss;
    uint32_t evt_crcok,  evt_crcerror, evt_bcmatch;
    uint32_t evt_edend,  evt_edstopped;
    uint32_t evt_ccaidle, evt_ccabusy, evt_ccastopped;
    uint32_t evt_rateboost, evt_mhrmatch, evt_sync;
    uint32_t evt_ctepresent;

    /* RX byte-stream parser state. */
    int rx_phase;
    int rx_remaining;
    int rx_offset;
    /* Honest FCS check over the delivered byte stream (see nrf52840):
     * running CCITT-16 (bit-reversed 802.15.4 idiom) + received FCS
     * bytes; crcstatus backs the CRCSTATUS register. */
    uint16_t rx_crc;
    uint8_t  rx_fcs[2];
    uint32_t crcstatus;
    /* "Disable when frame ends." nrf_802154 issues TASKS_DISABLE from
     * its BCMATCH IRQ once the header has been parsed; on real HW the
     * in-flight bytes still finish their DMA write before the radio
     * actually stops. We mirror that by deferring the state change
     * until the byte parser reaches end-of-frame. Without this, csim
     * drops every payload byte after the first BCMATCH and the upper
     * layers never see the full DIO. */
    int rx_disable_pending;
    /* TASKS_START debounce. nrf_802154 fans TASKS_TXEN AND
     * TASKS_START out through multiple DPPI subscribers; in csim
     * those all fire in the same cycle, each re-arming and re-emitting
     * the TX frame so the on-air traffic gets tripled. Real HW gates
     * this naturally because the radio is in TX state through the
     * entire transmission (10s of µs) and the trigger is edge-
     * sensitive on TXIDLE entry. We mirror that by remembering the
     * CPU cycle of the last emit and refusing to emit a second time
     * within the same cycle. */
    int      tx_armed;
    int64_t  last_tx_emit_cycle;
    int64_t  last_txen_cycle;
    int64_t  last_rxen_cycle;
    /* BCC value that has already triggered a BCMATCH in this frame.
     * On real HW the BCC register retains its programmed value after
     * a BCMATCH — the comparator just doesn't re-fire until the
     * firmware writes a new (higher) BCC. Earlier code zeroed
     * `r->bcc` on fire, which made `nrf_radio_bcc_get()` return 0 in
     * the IRQ handler; the driver then called the parser with
     * valid_data_len=0 and the parser bailed → abort. Tracking the
     * last-fired BCC separately lets us suppress re-fires while
     * preserving the register value the driver reads back. */
    uint32_t bcc_last_fired;

    /* TX byte listener — installed by the multinode harness. */
    void (*tx_cb)(void *user, uint8_t byte);
    void  *tx_user;

    /* Deferred TX completion.  On real hardware a TX takes
     * (preamble+SFD+PHR+payload+FCS) bytes * 32 us, and PHYEND fires at
     * that air-time boundary — long after the driver has finished its
     * critical-section setup and exited wait_for_flag.  csim's emit_tx
     * runs synchronously, so firing PHYEND in the same cycle drops the
     * IRQ inside the driver's still-active critical section (RADIO IRQ
     * disabled in NVIC), delaying it by milliseconds.  Schedule PHYEND
     * for the real air-time end so the driver gets it in normal context.
     *
     * The event also drives END/PHYEND-triggered SHORTS (END_START,
     * PHYEND_START, PHYEND_DISABLE) and the TX→TXIDLE→(DISABLED) state
     * dance that used to happen inline at TASKS_START. */
    arm_event_t  tx_end_event;
    int          tx_end_scheduled;

    /* Force-complete a deferred TASKS_DISABLE if the byte parser stalls.
     * When the firmware triggers TASKS_DISABLE mid-frame we usually want
     * to let the parser finish the in-flight bytes (so upper layers see
     * the full frame — see rx_disable_pending comment above). But in a
     * 3-node chain test, RX collisions can leave the parser stuck: the
     * peer aborts its TX mid-frame, no more bytes arrive, the parser
     * never fires end-of-frame, and the driver's
     * wait_until_radio_is_disabled() busy-wait at trx.c:328 asserts
     * after ~250 µs (MAX_RAMPDOWN_CYCLES = 50 * cpu_MHz).
     *
     * Real HW completes the rampdown either via end-of-frame or an
     * internal timeout — the driver's wait loop always sees DISABLED.
     * Mirror that here: schedule a fallback event when we set
     * rx_disable_pending, fires ~100 µs later, and force-completes the
     * disable if the parser hasn't already done so. */
    arm_event_t  rx_disable_timeout_event;
    int          rx_disable_timeout_scheduled;

    /* Frame-stall recovery (M9.5: no chip-local watchdog event anymore).
     * Sibling of rx_disable_timeout but for the OTHER stuck-parser path:
     * the firmware enters the RADIO peripheral via TASKS_RXEN/START and
     * sits in RX, waiting for an inbound frame to complete via PHYEND +
     * the PHYEND_DISABLE SHORTS chain. If the peer aborts mid-frame the
     * byte parser stalls in READ_PHR / READ_PAYLOAD, PHYEND never fires,
     * the SHORTS chain never triggers, and the driver eventually enters
     * wait_until_radio_is_disabled() with state=RX and pending=0 → the
     * same trx.c:360 assert as the deferred-disable path, but unreachable
     * by the rx_disable_pending mechanism because the firmware never
     * issued an explicit TASKS_DISABLE here.
     *
     * Real HW recovers via signal-loss detection / preamble timeout in
     * the analog front-end. The simulation kernel's radio bus mirrors
     * that: it fires nrf54l_radio_rx_stall() when no RF byte arrived for
     * this mote within SIM_RADIO_RX_STALL_NS of *sim time* after the
     * last delivered byte (see sim_radio_bus.h). The previous
     * chip-internal cpu-cycle watchdog needed a 50 ms band-aid because
     * the receiver's cycle clock stands still while a synchronously
     * emitted frame traverses the parser; sim time does not. */

    /* Deferred DISABLED-event fire. Real nRF54L15 takes ~250 ns
     * (~32 cpu cycles) between TASKS_DISABLE triggering and EVENTS_DISABLED
     * firing (rampdown latency). csim previously fired the event
     * synchronously inside the TASKS_DISABLE handler, which made the IRQ
     * pending immediately. The CPU then dispatched the IRQ before the
     * firmware could enter wait_until_radio_is_disabled(); the IRQ
     * handler re-armed shorts and triggered TASKS_RXEN, taking the
     * radio back to RX. By the time the wait ran, state was RX → the
     * trx.c:360 assert. Deferring the event a small number of cycles
     * gives the firmware a window to enter the wait first; it reads
     * state=DISABLED (set synchronously), returns success, and only
     * then does the IRQ for DISABLED dispatch. */
    arm_event_t  disabled_event_defer;
    int          disabled_event_defer_scheduled;
} nrf54l_radio_state_t;

/* EGU (Event Generator Unit) — 16-channel software-triggerable
 * event source.  nrf_802154 uses it as the "kick" point for the
 * ramp-up DPPI chain: CPU writes TASKS_TRIGGER[n] → EVENTS_TRIGGERED[n]
 * fires → PUBLISH_TRIGGERED[n] publishes on its bound channel →
 * RADIO.SUBSCRIBE_RXEN (or TXEN) is gated on that channel → state
 * machine starts.
 *
 * One csim model instance covers all four EGU bases (00/10/20/30);
 * they share the global DPPI fabric like everything else.
 */
#define NRF54L_EGU_NUM_CHANNELS 16

/* Per-channel DPPI binding, embedded in the owning EGU instance (see the
 * radio binding note above — no shared file-scope table across nodes). */
struct nrf54l_egu_state;
typedef struct {
    struct nrf54l_egu_state *egu;
    int                      task_n;
} nrf54l_egu_sub_binding_t;

typedef struct nrf54l_egu_state {
    arm_platform_t      *plat;
    nrf54l_dppi_state_t *dppi;
    uint32_t             events[NRF54L_EGU_NUM_CHANNELS];
    uint32_t             publish[NRF54L_EGU_NUM_CHANNELS];
    uint32_t             subscribe[NRF54L_EGU_NUM_CHANNELS];
    int                  sub_channel[NRF54L_EGU_NUM_CHANNELS];
    nrf54l_egu_sub_binding_t sub_bindings[NRF54L_EGU_NUM_CHANNELS];
    uint32_t             inten;
    int                  irq_num;
} nrf54l_egu_state_t;

/* TIMER (instances TIMER00/10/20/21/22/23/24).  Up to 6 CC channels.
 * Backing model: 32-bit counter at 16 MHz / 2^PRESCALER, derived from
 * sim_time_ns when needed.  Compare events fire from the CPU event queue. */
#define NRF54L_TIMER_NUM_CC  6

/* Per-CC compare-event firing context, embedded in the owning timer instance
 * (was a file-scope timer_cc_ctx[2][6] shared across nodes). */
struct nrf54l_timer_state;
typedef struct {
    struct nrf54l_timer_state *t;
    int                        n;
} nrf54l_timer_cc_ctx_t;

typedef struct nrf54l_timer_state {
    arm_platform_t      *plat;
    nrf54l_dppi_state_t *dppi;
    nrf54l_timer_cc_ctx_t cc_ctx[NRF54L_TIMER_NUM_CC];
    uint32_t             cc[NRF54L_TIMER_NUM_CC];
    uint32_t             events_compare[NRF54L_TIMER_NUM_CC];
    uint32_t             publish_compare[NRF54L_TIMER_NUM_CC];
    uint32_t             subscribe_capture[NRF54L_TIMER_NUM_CC];
    int                  sub_capture_ch[NRF54L_TIMER_NUM_CC];
    uint32_t             subscribe_start;
    uint32_t             subscribe_stop;
    uint32_t             subscribe_count;
    uint32_t             subscribe_clear;
    uint32_t             shorts;
    uint32_t             inten;
    uint32_t             mode;
    uint32_t             bitmode;          /* 0=16, 1=8, 2=24, 3=32 */
    uint32_t             prescaler;        /* counter clock = 16 MHz >> prescaler */
    uint32_t             counter;          /* used in Counter mode */
    int64_t              t0_ns;            /* sim_time_ns when started/cleared */
    uint32_t             snapshot;         /* counter at last stop */
    bool                 running;
    int                  irq_num;
    arm_event_t          ev_compare[NRF54L_TIMER_NUM_CC];
    uint32_t             base_addr;        /* for IO routing */
} nrf54l_timer_state_t;

