nfi/cooja-ng/include/arm/nrf54l15_soc.h
/* FICR.INFO.DEVICEID at 0x00FFC304/0x00FFC308 (FICR base 0x00FFC000,
 * INFO at +0x300, DEVICEID at +0x004). Contiki's
 * arch/cpu/nrf/sys/linkaddr-arch.c reads these two 32-bit words and
 * combines them with the Nordic OUI (f4:ce:36) to produce the EUI-64
 * stored in linkaddr_node_addr. Without per-node values, every
 * simulated node ends up with identical link-layer + IPv6 addresses
 * — RPL/6LoWPAN treats incoming DIOs as self-frames and drops them,
 * so no DAG ever forms. The harness seeds these per-node before the
 * firmware runs populate_link_address(). */
typedef struct nrf54l_ficr_state {
    uint32_t deviceid0;     /* INFO.DEVICEID[0] @ 0x00FFC304 */
    uint32_t deviceid1;     /* INFO.DEVICEID[1] @ 0x00FFC308 */
} nrf54l_ficr_state_t;

/* VPR (FLPR RV32E coprocessor) launch control + SPU permission gate.
 * The M33 (Contiki's flpr-host) releases the FLPR from reset with the
 * Zephyr nordic_vpr_launcher sequence:
 *   1. memcpy blob -> 0x20028000 (shared SRAM)
 *   2. SPU00.PERIPH[12].PERM |= SECATTR (Secure)   @ 0x50040530
 *   3. VPR00.INITPC = exec_addr                     @ 0x5004C808
 *   4. VPR00.CPURUN = 1                             @ 0x5004C800
 * csim latches these and, on the CPURUN 0->1 edge (with SECATTR set),
 * spins up an RV32E core (rv->flpr) pointed at the shared SRAM. */
struct riscv_cpu; /* fwd decl — defined in include/riscv/riscv_cpu.h */
typedef struct nrf54l_vpr_state {
    arm_platform_t   *plat;
    uint32_t          initpc;        /* VPR00.INITPC          @ +0x808 */
    uint32_t          cpurun;        /* VPR00.CPURUN          @ +0x800 */
    uint32_t          spu_periph12;  /* SPU00.PERIPH[12].PERM @ 0x50040530 */
    int               launched;      /* set once the FLPR has been started */
    struct riscv_cpu *flpr;          /* RV32E core, NULL until launched */
} nrf54l_vpr_state_t;

/* GPIO port (P0/P1/P2). Minimal model: OUT/DIR register file with the
 * SET/CLR aliases. Enough to drive + observe the demo LEDs — LED0 on
 * P2.9 (FLPR) and LED1 on P1.10 (M33). out_toggles counts OUT-bit
 * transitions so a test can assert the blink actually happens. */
struct nrf54l_gpio_state;
typedef void (*nrf54l_gpio_change_cb)(void *user, struct nrf54l_gpio_state *g);

typedef struct nrf54l_gpio_state {
    arm_platform_t *plat;
    uint32_t        base;
    int             port;         /* 0/1/2 for diagnostics */
    uint32_t        out;          /* OUT latch */
    uint32_t        dir;          /* DIR (1 = output) — mirrors PIN_CNF[n].DIR */
    uint32_t        pin_cnf[32];  /* PIN_CNF[n] @ 0x80 (nrf_gpio_cfg writes these) */
    uint64_t        out_toggles;  /* total OUT-bit flips since reset */
    /* Input pins driven from outside (shell `gpio` / `button`).  IN reads
     * the OUT latch back (no input model), except for pins in in_forced,
     * which read in_level.  No GPIOTE/SENSE interrupt is raised. */
    uint32_t        in_forced;
    uint32_t        in_level;
    /* Fired after any OUT / DIR / PIN_CNF change so the SoC can forward
     * chip-select edges to off-SoC SPI chips. */
    nrf54l_gpio_change_cb change_cb;
    void           *change_user;
} nrf54l_gpio_state_t;

/* --- Off-SoC SPI chips on the SPIM buses --------------------------------
 * Contiki's os/dev/spi.c drives chip-select as a plain GPIO, so a chip is
 * "selected" while its CS pin is configured as an output and driven low.
 * The SoC routes each SPIM byte to the chip whose CS is low on that
 * instance; with none selected MISO floats high (0xFF).  Chips are
 * attached by name (nrf54l15_soc_attach_spi_chip) from the platform
 * defaults or a node's config "peripherals" list. */
#define NRF54L_MAX_SPI_CHIPS 4

typedef struct nrf54l_spi_chip {
    char     name[16];            /* "mx25r6435f", "enc28j60", … ("" = free slot) */
    int      spim;                /* SPIM instance id: 0, 22 or 30 */
    int      cs_port, cs_pin;
    bool     cs_low;              /* last chip-select level delivered to the chip */
    /* Chip vtable, filled by the attach code per chip kind.  The chip
     * state itself is heap-allocated so this header needs no chip types. */
    uint8_t (*exchange)(void *chip, uint8_t mosi);
    void    (*set_cs)(void *chip, bool low);
    void    (*destroy)(void *chip);
    void    *chip;
} nrf54l_spi_chip_t;

/* SPIM instances modelled: 00 (fast domain, on-board flash), 22 (DK
 * expansion header), 30.  20 is the console's SERIAL20 slot and 21's base
 * (0x500C7000) is where this SoC currently registers EGU20, so neither is
 * instantiated. */
#define NRF54L_NUM_SPIM 3

/* WDT30 (0x5010_8000) — the TrustZone secure world's watchdog. The nRF54L15
 * watchdogs have no interrupt: a timeout resets the SoC directly. Contiki's
 * secure world configures CRV for a 2 s timeout with reload channel 0 and
 * feeds RR[0] from both worlds (the normal world through an SG veneer).
 * WDT30 has no Non-secure alias — it is reachable only at 0x5010_8000. */
#define NRF54L_WDT_NUM_CHANNELS 8
typedef struct nrf54l_wdt_state {
    arm_platform_t *plat;
    uint32_t        crv;          /* counter reload value, in 32.768 kHz ticks */
    uint32_t        rren;         /* per-channel reload enable */
    uint32_t        config;
    uint32_t        tsen;
    uint32_t        inten;
    uint32_t        evt_timeout;
    uint32_t        evt_stopped;
    uint32_t        reqstatus;    /* channels still owing a reload this period */
    bool            running;
    arm_event_t     timeout_event;
    int             timeout_scheduled;
    uint32_t        base_addr;
} nrf54l_wdt_state_t;

typedef struct nrf54l15_soc {
    nrf54l_global_clock_state_t global_clock;
    nrf54l_uarte_state_t        uarte20;
    nrf54l_grtc_state_t         grtc;
    nrf54l_dppi_state_t         dppi;
    nrf54l_radio_state_t        radio;
    nrf54l_ficr_state_t         ficr;
    nrf54l_vpr_state_t          vpr;
    nrf54l_gpio_state_t         gpio[3];   /* P0, P1, P2 */
    nrf54l_wdt_state_t          wdt30;
    uint32_t                    icache_enable;
    /* Three EGU instances at 0x5001_5000 (EGU00), 0x5008_7000 (EGU10),
     * 0x500C_7000 (EGU20).  Channel allocation across instances is
     * domain-local on real HW; csim collapses to the global DPPI. */
    nrf54l_egu_state_t          egu00;
    nrf54l_egu_state_t          egu10;
    nrf54l_egu_state_t          egu20;
    /* TIMER instances.  TIMER10/20 are the ones used by the nrf_802154
     * lptimer backend. */
    nrf54l_timer_state_t        timer10;
    nrf54l_timer_state_t        timer20;
    /* SPIM00 / SPIM22 / SPIM30 (see NRF54L_NUM_SPIM) + the chips hanging
     * off them.  `live_host` is plat->host with a cycle-derived now_ns —
     * the transfer-completion event must be armed from live time, not
     * the batch-stale sim_time_ns (docs/porting-a-device.md §8). */
    nrf54l_spim_t               spim[NRF54L_NUM_SPIM];
    nrf54l_spi_chip_t           spi_chips[NRF54L_MAX_SPI_CHIPS];
    sim_host_t                  live_host;
    arm_platform_t             *plat;
} nrf54l15_soc_t;

/* Attach an off-SoC SPI chip by name to a SPIM instance with its
 * chip-select on P<port>.<pin>.  Known names: "mx25r6435f", "enc28j60".
 * Returns the slot index, or -1 (unknown chip / instance, or no slot).
 * nrf54l15_soc_clear_spi_chips() drops every attached chip — the runner
 * calls it before applying an explicit per-node "peripherals" list so
 * the platform defaults do not linger. */
int  nrf54l15_soc_attach_spi_chip(nrf54l15_soc_t *soc, const char *name,
                                  int spim_id, int cs_port, int cs_pin);
void nrf54l15_soc_clear_spi_chips(nrf54l15_soc_t *soc);
/* The SPIM instance with the given id (0/22/30), or NULL. */
nrf54l_spim_t *nrf54l15_soc_spim(nrf54l15_soc_t *soc, int spim_id);

/* nrf54l15 RADIO STATE enum (from SVD). */
#define NRF54L_RADIO_STATE_DISABLED   0
#define NRF54L_RADIO_STATE_RXRU       1
#define NRF54L_RADIO_STATE_RXIDLE     2
#define NRF54L_RADIO_STATE_RX         3
#define NRF54L_RADIO_STATE_RXDISABLE  4
#define NRF54L_RADIO_STATE_TXRU       9
#define NRF54L_RADIO_STATE_TXIDLE     10
#define NRF54L_RADIO_STATE_TX         11
#define NRF54L_RADIO_STATE_TXDISABLE  12

/* Public DPPI API for other peripherals to wire publish/subscribe. */
void nrf54l_dppi_subscribe(nrf54l_dppi_state_t *d, int channel,
                           nrf54l_dppi_sub_cb cb, void *user);
void nrf54l_dppi_unsubscribe(nrf54l_dppi_state_t *d, int channel,
                             nrf54l_dppi_sub_cb cb, void *user);
void nrf54l_dppi_publish(nrf54l_dppi_state_t *d, int channel);

/* Public radio hooks for the multinode harness. */
typedef void (*nrf54l_radio_tx_listener_t)(void *user, uint8_t byte);
void nrf54l_radio_set_tx_listener(nrf54l15_soc_t *soc,
                                   nrf54l_radio_tx_listener_t cb, void *user);
void nrf54l_radio_receive_byte(nrf54l15_soc_t *soc, uint8_t byte);

/* RX-stall recovery entry (M9.5): invoked by the radio bus when no RF
 * byte arrived for this mote within the stall window of sim time.
 * No-op unless the parser is mid-frame (past WAIT_SFD); otherwise
 * abandons the frame and fires PHYEND so the PHYEND_DISABLE SHORTS
 * chain takes the radio to DISABLED, matching real HW's signal-loss
 * path. */
void nrf54l_radio_rx_stall(nrf54l15_soc_t *soc);


extern const arm_soc_ops_t nrf54l15_soc_ops;

static inline nrf54l15_soc_t *arm_platform_nrf54l15(arm_platform_t *plat) {
    if (!plat || !plat->config || plat->config->soc_ops != &nrf54l15_soc_ops)
        return NULL;
    return (nrf54l15_soc_t *)plat->soc;
}

#endif /* NRF54L15_SOC_H */
